Repository: Sulaev/test-MST
Catalog: ai-meal-planner/lib/l10n/app_*.arb
Languages: ru

# tabGenerate
source: Generate
ru: Генерация

# tabHistory
source: History
ru: История

# tabFeed
source: Feed
ru: Лента

source: Planner Inputs
ru: Параметры плана

source: Goal
ru: Цель

source: AI mode
ru: AI режим

source: Fast mode
ru: Быстрый режим

# aiOnlineModeCurrent
source: AI online mode (current endpoint)
ru: AI онлайн режим (текущий endpoint)

source: Deterministic local mode
ru: Локальный детерминированный режим

# aiModeDetails
source: Retry + timeout handling enabled. On failure auto-fallback to local planner.
ru: Включены retry + timeout. При ошибке AI автоматически включается локальный fallback.

# fastModeDetails
source: No AI dependency. Fast and stable local generation.
ru: Без зависимости от AI. Быстрая и стабильная локальная генерация.

source: Daily Calories
ru: Калории в день

source: Allergies
ru: Аллергии

# allergiesHint
source: e.g. peanuts, lactose
ru: например: арахис, лактоза

source: Preferences
ru: Предпочтения

# preferencesHint
source: e.g. high-protein, quick meals
ru: например: high-protein, quick meals

# weeklyAdherenceLabel
source: Weekly plan adherence: {percent}%
ru: Соблюдение плана за неделю: {percent}%

# daysLabel
source: Days: {days}
ru: Дней: {days}

source: Generating...
ru: Генерация...

source: Generate Meal Plan
ru: Сгенерировать план питания

# exportCurrentPlanPdf
source: Export Current Plan to PDF
ru: Экспорт в PDF

# refreshGoalTips
source: Refresh Goal Support Tips
ru: Обновить советы по цели

source: Share to Local Feed
ru: Опубликовать

source: Generation Status
ru: Статус генерации

source: Goal Support
ru: Поддержка цели

# secureConfigProvided
source: Secure config provided: {count}/15 keys
ru: Безопасная конфигурация: {count}/15 ключей

source: Clear
ru: Очистить

# noSavedPlans
source: No saved meal plans yet.
ru: Сохраненных планов пока нет.

source: Export PDF
ru: Экспорт PDF

# feedEmpty
source: Feed is empty. Share your first meal plan.
ru: Лента пуста. Опубликуйте первый план.

source: Favorite
ru: Избранное

source: Open recipe
ru: Открыть рецепт

source: Shopping list:
ru: Список покупок:

source: Tips:
ru: Советы:

# goalKcalPerDay
source: Goal: {goal} | {kcal} kcal/day
ru: Цель: {goal} | {kcal} ккал/день

# dailyCaloriesValidationError
source: Daily calories must be a number between 900 and 5000.
ru: Калории в день должны быть числом от 900 до 5000.

# loadedCachedAiResponse
source: Loaded cached AI response for same parameters.
ru: Загружен кэшированный AI-ответ для этих параметров.

# aiFallbackUsed
source: AI failed; used deterministic fallback.
ru: AI недоступен, использован локальный fallback.

source: Ready to generate.
ru: Готово к генерации.

# checkingInput
source: Checking input parameters...
ru: Проверка входных параметров...

# enrichingRecipes
source: Enriching meals with recipes...
ru: Обогащаем блюда рецептами...

# savingHistory
source: Saving plan to history...
ru: Сохранение плана в историю...

# planReady
source: Your plan is ready.
ru: Ваш план готов.

# generationFailed
source: Generation failed: {error}
ru: Ошибка генерации: {error}

source: Posted to local feed.
ru: Опубликовано в локальную ленту.

source: Could not open recipe URL.
ru: Не удалось открыть ссылку на рецепт.

# pdfExportFailed
source: PDF export failed: {error}
ru: Ошибка экспорта PDF: {error}

# waitingInput
source: Waiting for your input
ru: Ожидание параметров

# stepValidation
source: Step 1/6: Validation
ru: Шаг 1/6: Валидация

# stepCache
source: Step 2/6: Cache check
ru: Шаг 2/6: Проверка кэша

# stepAiRequest
source: Step 3/6: AI request
ru: Шаг 3/6: Запрос к AI

# stepLocalFallback
source: Step 4/6: Local generation/fallback
ru: Шаг 4/6: Локальная генерация/fallback

# stepEnrich
source: Step 5/6: Recipe enrichment
ru: Шаг 5/6: Обогащение рецептами

# stepSave
source: Step 6/6: Save result
ru: Шаг 6/6: Сохранение результата

source: Done
ru: Готово

source: Failed
ru: Ошибка

# goalWeightLoss
source: Weight loss
ru: Снижение веса

# goalMuscleGain
source: Muscle gain
ru: Набор мышечной массы

# goalHealth
source: Health
ru: Здоровье

# goalMaintenanceRecomp
source: Maintenance / Recomp
ru: Поддержание / рекомпозиция

# allFilter
source: All
ru: Все

# purchaseSuccess
source: Purchase completed.
ru: Покупка завершена.

# restoreSuccess
source: Purchases restored.
ru: Покупки восстановлены.

# subscriptionTitle
source: Subscription
ru: Подписка

# subscriptionApiKeyMissing
source: APPHUD_API_KEY is not set. Add it via --dart-define to enable subscriptions.
ru: APPHUD_API_KEY не задан. Передайте его через --dart-define для включения подписок.

source: Subscription active
ru: Подписка активна

# subscriptionInactive
source: No active subscription
ru: Активной подписки нет

source: Restore purchases
ru: Восстановить покупки

# subscriptionNoProducts
source: No products found for current placement/paywall.
ru: Для текущего placement/paywall продукты не найдены.

source: Buy
ru: Купить

# trackingTitle
source: Tracking & Attribution
ru: Трекинг и атрибуция

source: ATT status
ru: Статус ATT

# appsflyerStarted
source: AppsFlyer SDK started
ru: AppsFlyer SDK запущен

# appsflyerNotStarted
source: AppsFlyer SDK not started
ru: AppsFlyer SDK не запущен

source: Conversion data received
ru: Данные конверсии получены

# freepikToolsTitle
source: Freepik Image Tools
ru: Инструменты Freepik

# freepikImageUrl
source: Image URL
ru: Ссылка на изображение

# freepikRemoveBackground
source: Remove background
ru: Удалить фон

# freepikSegment
source: Segment object
ru: Сегментировать объект

# freepikReady
source: Processed image is ready
ru: Обработанное изображение готово

# freepikEnterImageUrl
source: Enter an image URL first.
ru: Сначала введите ссылку на изображение.

# kcalUnit
source: kcal
ru: ккал

# profileTitle
source: Profile
ru: Профиль

# profileGender
source: Gender
ru: Пол

# profileGenderMale
source: Male
ru: Мужской

# profileGenderFemale
source: Female
ru: Женский

# profileGenderOther
source: Other
ru: Другое

# profileWeight
source: Weight
ru: Вес

# profileHeight
source: Height
ru: Рост

# profileKg
source: kg
ru: кг

# profileCm
source: cm
ru: см

# profileGoal
source: Goal
ru: Цель

# profileLanguage
source: Language
ru: Язык

# profileLanguageSystem
source: System
ru: Системный

# languageEnglish
source: English
ru: Английский

# languageRussian
source: Russian
ru: Русский

# profileSave
source: Save
ru: Сохранить

# profileCancel
source: Cancel
ru: Отмена

# achievementsTitle
source: Achievements
ru: Достижения

# achFirstPlanTitle
source: First meal plan
ru: Первый рацион

# achFirstPlanSubtitle
source: Create your first plan.
ru: Создайте свой первый план питания.

# ach3PlansTitle
source: 3 plans created
ru: Создано 3 плана

# ach3PlansSubtitle
source: Generate 3 meal plans.
ru: Сгенерируйте 3 плана питания.

# ach5PlansTitle
source: 5 plans created
ru: Создано 5 планов

# ach5PlansSubtitle
source: Generate 5 meal plans.
ru: Сгенерируйте 5 планов питания.

# ach7PlansTitle
source: 7 plans created
ru: Создано 7 планов

# ach7PlansSubtitle
source: Generate 7 meal plans.
ru: Сгенерируйте 7 планов питания.

# achShareFeedTitle
source: Shared to feed
ru: Опубликовано в ленте

# achShareFeedSubtitle
source: Post an interesting plan to the feed.
ru: Поделитесь интересным планом в ленту.

# achFavoriteTitle
source: Favorite curator
ru: Куратор ленты

# achFavoriteSubtitle
source: Mark at least one feed post as favorite.
ru: Добавьте хотя бы один пост в избранное.

# achCopyPlanTitle
source: Saved from feed
ru: Сохранено из ленты

# achCopyPlanSubtitle
source: Copy a plan from the feed to your history.
ru: Скопируйте план из ленты в историю.

# achExportPdfTitle
source: PDF exporter
ru: Экспорт в PDF

# achExportPdfSubtitle
source: Export a plan to PDF.
ru: Экспортируйте план в PDF.

# achOpenRecipeTitle
source: Recipe explorer
ru: Открыл рецепт

# achOpenRecipeSubtitle
source: Open a recipe link.
ru: Откройте ссылку на рецепт.

# feedOpenPlan
source: Open plan
ru: Открыть план

# feedCopyPlan
source: Copy
ru: Копировать

# feedCopiedToHistory
source: Copied to your history.
ru: Скопировано в историю.

# feedPlanUnavailable
source: This post does not contain a full plan.
ru: В этом посте нет полного плана.

# feedFollowPlan
source: Follow
ru: Следовать

# feedFollowingNow
source: Plan added. You can follow it now.
ru: План добавлен. Можно начинать следовать.
